# Tap
tap 'homebrew/apache'
tap 'homebrew/boneyard'
tap 'homebrew/bundle'
tap 'homebrew/completions'
tap 'homebrew/dupes'
tap 'homebrew/nginx'
tap 'homebrew/python'
tap 'homebrew/versions'

tap 'mackerelio/mackerel-agent'
tap 'ymyzk/ymyzk'

# Homebrew
brew 'asciinema'
brew 'aspell', args: ['with-lang-en']
brew 'autoconf'
brew 'automake'
brew 'binutils'
brew 'carthage'
brew 'closure-compiler'
brew 'cmake'
brew 'colordiff'
brew 'coq'
brew 'coreutils'
brew 'docker-completion'
brew 'docker-compose-completion'
brew 'emacs', args: ['with-cocoa']
brew 'erlang'
brew 'exiftool'
brew 'gcc'
brew 'ghq'
brew 'git'
brew 'git-lfs'
brew 'go'
brew 'haskell-stack'
brew 'heroku'
brew 'htop'
brew 'hub'
brew 'imagemagick', args: ['with-webp']
brew 'jq'
brew 'libmemcached'
brew 'libtool'
brew 'mercurial'
brew 'mysql'
brew 'nasm'
brew 'nkf'
brew 'nmap'
brew 'ocaml'
brew 'opam'
brew 'openssl'
brew 'pandoc'
brew 'peco'
brew 'pypy'
brew 'pypy3'
brew 'python'
brew 'python3'
brew 'qemu'
brew 'reattach-to-user-namespace', args: ['with-wrap-launchctl', 'with-wrap-pbcopy-and-pbpaste']
brew 'rlwrap'
brew 'ruby'
brew 'sbt'
brew 'shellcheck'
brew 'sl'
brew 'sqlite'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'vim', args: ['with-lua', 'HEAD']
brew 'watch'
brew 'wget'
brew 'xz'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

brew 'neovim/neovim/neovim'

brew 'ymyzk/ymyzk/ochacaml'
