# Tap
tap 'homebrew/apache'
tap 'homebrew/boneyard'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/nginx'
tap 'homebrew/php'
tap 'homebrew/python'
tap 'homebrew/science'
tap 'homebrew/versions'

tap 'mackerelio/mackerel-agent'
tap 'neovim/neovim'
tap 'ymyzk/ymyzk'

# Homebrew
brew 'asciinema'
brew 'aspell', args: ['with-lang-en']
brew 'autoconf'
brew 'automake'
brew 'binutils'
brew 'carthage'
brew 'closure-compiler'
brew 'cmake'
brew 'colordiff'
brew 'coq'
brew 'coreutils'
brew 'docker'
brew 'docker-compose'
brew 'docker-machine'
brew 'emacs', args: ['with-cocoa']
brew 'exiftool'
brew 'gcc'
brew 'git'
brew 'go'
brew 'haskell-stack'
brew 'heroku'
brew 'htop'
brew 'hub'
brew 'libtool'
brew 'nasm'
brew 'nkf'
brew 'nmap'
brew 'ocaml'
brew 'opam'
brew 'openssl'
brew 'pandoc'
brew 'peco'
brew 'pypy'
brew 'pypy3'
brew 'python'
brew 'python3'
brew 'qemu'
brew 'racket'
brew 'reattach-to-user-namespace'
brew 'rlwrap'
brew 'ruby'
brew 'rust'
brew 'scala'
brew 'sl'
brew 'sqlite'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'vim', args: ['with-luajit', 'HEAD']
brew 'watch'
brew 'wget'
brew 'xz'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

brew 'ymyzk/ymyzk/ochacaml'
