# Tap
tap 'homebrew/apache'
tap 'homebrew/boneyard'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/nginx'
tap 'homebrew/php'
tap 'homebrew/python'
tap 'homebrew/science'
tap 'homebrew/versions'

tap 'mackerelio/mackerel-agent'
tap 'neovim/neovim'
tap 'ymyzk/ymyzk'

# Homebrew
brew 'asciinema'
brew 'aspell', args: ['with-lang-en']
brew 'autoconf'
brew 'automake'
brew 'binutils'
brew 'carthage'
brew 'closure-compiler'
brew 'cmake'
brew 'colordiff'
brew 'coq'
brew 'coreutils'
brew 'docker'
brew 'docker-compose'
brew 'docker-machine'
brew 'git'
brew 'go'
brew 'libtool'
brew 'nvm'
brew 'ocaml'
brew 'openssl'
brew 'peco'
brew 'python'
brew 'reattach-to-user-namespace'
brew 'rlwrap'
brew 'sqlite'
brew 'tmux'
brew 'vim', args: ['with-luajit', 'HEAD']
brew 'watch'
brew 'wget'
brew 'xz'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
